In [ ]:
# SQLite Lab Solutions

In [2]:
import sqlite3
print(sqlite3.version)

2.6.0

/var/folders/8p/lhfbj_0n501d3lhdqz4xc0dh0000gn/T/ipykernel_50872/4112040650.py:2: DeprecationWarning: version is deprecated and will be removed in Python 3.14
  print(sqlite3.version)

In [4]:
import sqlite3

conn = sqlite3.connect("lab1_bank.sqlite")
cursor = conn.cursor()


cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Tables of dataset:", tables)


conn.close()

Tables of dataset: [('account',), ('card',), ('client',), ('disp',), ('district',), ('loan',), ('order',), ('trans',)]

In [32]:
# Query 1 / Get the id values of the first 5 clients from district_id with a value equals to 1.
import sqlite3

conn = sqlite3.connect("lab1_bank.sqlite")
cursor = conn.cursor()

cursor.execute("SELECT client_id FROM client WHERE district_id = 1 ORDER BY client_id ASC LIMIT 5")

rows = cursor.fetchall()


for row in rows:
    print(row)

(2,)
(3,)
(22,)
(23,)
(28,)

In [34]:
# Query 2 / In the client table, get an id value of the last client where the district_id equals to 72.
cursor.execute("SELECT client_id FROM client WHERE district_id = 72 ORDER BY client_id DESC LIMIT 1")

rows = cursor.fetchall()


for row in rows:
    print(row)

(13576,)

In [36]:
# Query 3 / Get the 3 lowest amounts in the loan table.
cursor.execute("SELECT amount FROM loan ORDER BY amount ASC LIMIT 3")

rows = cursor.fetchall()


for row in rows:
    print(row)

(4980,)
(5148,)
(7656,)

In [42]:
# Query 4 / What are the possible values for status, ordered alphabetically in ascending order in the loan table?
cursor.execute("SELECT DISTINCT status FROM loan ORDER BY status ASC")

rows = cursor.fetchall()

for row in rows:
    print(row)

('A',)
('B',)
('C',)
('D',)

In [44]:
# Query 5 / What is the loan_id of the highest payment received in the loan table?
cursor.execute("SELECT loan_id FROM loan ORDER BY payments DESC LIMIT 1")

rows = cursor.fetchall()

for row in rows:
    print(row)

(6415,)

In [46]:
# Query 6 / What is the loan amount of the lowest 5 account_ids in the loan table? Show the account_id and the corresponding amount
cursor.execute("SELECT account_id, amount FROM loan ORDER BY account_id ASC LIMIT 5")

rows = cursor.fetchall()

for row in rows:
    print(row)

(2, 80952)
(19, 30276)
(25, 30276)
(37, 318480)
(38, 110736)

In [48]:
# Query 7 / What are the account_ids with the lowest loan amount that have a loan duration of 60 in the loan table?
cursor.execute("SELECT account_id FROM loan WHERE duration = 60 ORDER BY amount ASC LIMIT 5")

rows = cursor.fetchall()

for row in rows:
    print(row)

(10954,)
(938,)
(10711,)
(1766,)
(10799,)

In [60]:
# Query 8 / What are the unique values of k_symbol in the order table?
cursor.execute("SELECT DISTINCT TRIM(k_symbol) FROM `order` WHERE k_symbol IS NOT NULL AND TRIM(k_symbol) != '' ORDER BY k_symbol ASC;",)

rows = cursor.fetchall()

for row in rows:
    print(row)

('LEASING',)
('POJISTNE',)
('SIPO',)
('UVER',)

In [62]:
# Query 9 / In the order table, what are the order_ids of the client with the account_id 34?
cursor.execute("SELECT order_id FROM `order` WHERE account_id = 34;")

rows = cursor.fetchall()

for row in rows:
    print(row)

(29445,)
(29446,)
(29447,)

In [64]:
# Query 10 / In the order table, which account_ids were responsible for orders between order_id 29540 and order_id 29560 (inclusive)?
cursor.execute("SELECT DISTINCT account_id FROM `order` WHERE order_id BETWEEN 29540 AND 29560")

rows = cursor.fetchall()

for row in rows:
    print(row)

(88,)
(90,)
(96,)
(97,)

In [70]:
# Query 11 / In the order table, what are the individual amounts that were sent to (account_to) id 30067122?
cursor.execute("SELECT DISTINCT CAST(amount AS INTEGER) FROM `order` WHERE account_to = 30067122;")


rows = cursor.fetchall()

for row in rows:
    print(row)

(5123,)

In [74]:
# Query 12 / In the trans table, show the trans_id, date, type and amount of the 10 first transactions from account_id 793 in chronological order, from newest to oldest.
cursor.execute("SELECT trans_id, date, type, amount FROM trans WHERE account_id = 793 ORDER BY date DESC LIMIT 10")

rows = cursor.fetchall()

for row in rows:
    print(row)

(3556468, 981231, 'PRIJEM', 78.6)
(233254, 981216, 'VYDAJ', 600.0)
(233104, 981212, 'VYDAJ', 1212.0)
(233248, 981211, 'VYDAJ', 851.0)
(233176, 981207, 'VYDAJ', 204.0)
(3556467, 981130, 'PRIJEM', 75.1)
(233395, 981130, 'VYDAJ', 14.6)
(233103, 981112, 'VYDAJ', 1212.0)
(233247, 981111, 'VYDAJ', 851.0)
(233175, 981107, 'VYDAJ', 204.0)

In [76]:
# Query 13 / In the client table, of all districts with a district_id lower than 10, how many clients are from each district_id? Show the results sorted by the district_id in ascending order.
cursor.execute("SELECT district_id, COUNT(*) AS client_count FROM client WHERE district_id < 10 GROUP BY district_id ORDER BY district_id ASC")

rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 663)
(2, 46)
(3, 63)
(4, 50)
(5, 71)
(6, 53)
(7, 45)
(8, 69)
(9, 60)

In [78]:
# Query 14 / In the card table, how many cards exist for each type? Rank the result starting with the most frequent type.
cursor.execute("SELECT type, COUNT(*) AS card_count FROM card GROUP BY type ORDER BY card_count DESC")

rows = cursor.fetchall()

for row in rows:
    print(row)

('classic', 659)
('junior', 145)
('gold', 88)

In [80]:
# Query 15 / Using the loan table, print the top 10 account_ids based on the sum of all of their loan amounts.
cursor.execute("SELECT account_id, SUM(amount) AS total_loan FROM loan GROUP BY account_id ORDER BY total_loan DESC LIMIT 10")

rows = cursor.fetchall()

for row in rows:
    print(row)

(7542, 590820)
(8926, 566640)
(2335, 541200)
(817, 538500)
(2936, 504000)
(7049, 495180)
(10451, 482940)
(6950, 475680)
(7966, 473280)
(339, 468060)

In [88]:
# Query 16 / In the loan table, retrieve the number of loans issued for each day, before (excl) 930907, ordered by date in descending order.
cursor.execute("SELECT date, COUNT(*) AS loan_count FROM loan WHERE date < 930907 GROUP BY date ORDER BY date DESC;")

rows = cursor.fetchall()

for row in rows:
    print(row)

(930906, 1)
(930803, 1)
(930728, 1)
(930711, 1)
(930705, 1)

In [90]:
# Query 17 / In the loan table, for each day in December 1997, count the number of loans issued for each unique loan duration, ordered by date and duration, both in ascending order. You can ignore days without any loans in your output.
cursor.execute("SELECT date, duration, COUNT(*) AS loan_count FROM loan WHERE date BETWEEN 971201 AND 971225 GROUP BY date, duration ORDER BY date ASC, duration ASC")
rows = cursor.fetchall()
for row in rows:
    print(row)

(971206, 24, 1)
(971206, 36, 1)
(971208, 12, 3)
(971209, 12, 1)
(971209, 24, 1)
(971210, 12, 1)
(971211, 24, 1)
(971211, 48, 1)
(971213, 24, 1)
(971220, 36, 1)
(971221, 36, 1)
(971224, 60, 1)
(971225, 24, 1)
(971225, 60, 1)

In [92]:
# Query 18 / In the trans table, for account_id 396, sum the amount of transactions for each type (VYDAJ = Outgoing, PRIJEM = Incoming). Your output should have the account_id, the type and the sum of amount, named as total_amount. Sort alphabetically by type.
cursor.execute("SELECT account_id, type, SUM(amount) AS total_amount FROM trans WHERE account_id = 396 GROUP BY type ORDER BY type ASC")

rows = cursor.fetchall()

for row in rows:
    print(row)

(396, 'PRIJEM', 1028138.7)
(396, 'VYDAJ', 1485814.4)

In [94]:
conn.close()